wrk/results/put_cpu.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 3.115ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.929ms, rate sampling interval: 15ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.63ms    2.55ms  45.50ms   95.14%
    Req/Sec     1.08k     0.93k    6.92k    49.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.46ms
 90.000%    2.10ms
 99.000%   12.83ms
 99.900%   35.68ms
 99.990%   42.37ms
 99.999%   45.53ms
100.000%   45.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.259     0.000000            1         1.00
       0.659     0.100000         3993         1.11
       0.796     0.200000         7969         1.25
       0.923     0.300000        11937         1.43
       1.044     0.400000        15925         1.67
       1.161     0.500000        19910         2.00
       1.217     0.550000        21891         2.22
       1.278     0.600000        23883         2.50
       1.336     0.650000        25861         2.86
       1.398     0.700000        27857         3.33
       1.462     0.750000        29841         4.00
       1.502     0.775000        30833         4.44
       1.547     0.800000        31835         5.00
       1.605     0.825000        32820         5.71
       1.687     0.850000        33816         6.67
       1.820     0.875000        34805         8.00
       1.927     0.887500        35302         8.89
       2.103     0.900000        35800        10.00
       2.345     0.912500        36297        11.43
       2.695     0.925000        36793        13.33
       3.235     0.937500        37291        16.00
       3.605     0.943750        37541        17.78
       4.053     0.950000        37789        20.00
       4.599     0.956250        38037        22.86
       5.167     0.962500        38285        26.67
       5.915     0.968750        38534        32.00
       6.403     0.971875        38658        35.56
       6.971     0.975000        38782        40.00
       7.531     0.978125        38907        45.71
       8.415     0.981250        39031        53.33
       9.455     0.984375        39155        64.00
      10.087     0.985938        39217        71.11
      10.903     0.987500        39281        80.00
      12.327     0.989062        39341        91.43
      13.383     0.990625        39404       106.67
      14.623     0.992188        39466       128.00
      15.527     0.992969        39497       142.22
      16.591     0.993750        39528       160.00
      17.903     0.994531        39559       182.86
      20.383     0.995313        39590       213.33
      22.127     0.996094        39621       256.00
      23.855     0.996484        39637       284.44
      24.623     0.996875        39652       320.00
      26.031     0.997266        39668       365.71
      27.519     0.997656        39683       426.67
      29.711     0.998047        39699       512.00
      31.039     0.998242        39707       568.89
      32.111     0.998437        39714       640.00
      33.279     0.998633        39722       731.43
      34.975     0.998828        39730       853.33
      35.935     0.999023        39738      1024.00
      36.287     0.999121        39742      1137.78
      37.151     0.999219        39745      1280.00
      37.791     0.999316        39749      1462.86
      38.399     0.999414        39753      1706.67
      39.231     0.999512        39757      2048.00
      39.455     0.999561        39759      2275.56
      39.615     0.999609        39761      2560.00
      39.647     0.999658        39763      2925.71
      40.223     0.999707        39765      3413.33
      41.215     0.999756        39767      4096.00
      41.247     0.999780        39768      4551.11
      41.471     0.999805        39769      5120.00
      41.503     0.999829        39770      5851.43
      41.823     0.999854        39771      6826.67
      42.367     0.999878        39772      8192.00
      42.367     0.999890        39772      9102.22
      42.431     0.999902        39773     10240.00
      42.431     0.999915        39773     11702.86
      42.591     0.999927        39774     13653.33
      42.591     0.999939        39774     16384.00
      42.591     0.999945        39774     18204.44
      44.703     0.999951        39775     20480.00
      44.703     0.999957        39775     23405.71
      44.703     0.999963        39775     27306.67
      44.703     0.999969        39775     32768.00
      44.703     0.999973        39775     36408.89
      45.535     0.999976        39776     40960.00
      45.535     1.000000        39776          inf
#[Mean    =        1.627, StdDeviation   =        2.550]
#[Max     =       45.504, Total count    =        39776]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  82919 requests in 30.01s, 5.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 1211
Requests/sec:   2763.33
Transfer/sec:    180.80KB