wrk/results/put_lock.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 2.709ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.577ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.72ms    2.06ms  31.25ms   93.35%
    Req/Sec     0.87k   488.75     5.55k    83.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.26ms
 75.000%    1.59ms
 90.000%    2.57ms
 99.000%   11.79ms
 99.900%   22.62ms
 99.990%   30.43ms
 99.999%   31.26ms
100.000%   31.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.271     0.000000            1         1.00
       0.716     0.100000         3238         1.11
       0.876     0.200000         6468         1.25
       1.012     0.300000         9719         1.43
       1.138     0.400000        12941         1.67
       1.260     0.500000        16181         2.00
       1.316     0.550000        17790         2.22
       1.373     0.600000        19397         2.50
       1.435     0.650000        21030         2.86
       1.501     0.700000        22628         3.33
       1.589     0.750000        24242         4.00
       1.641     0.775000        25050         4.44
       1.706     0.800000        25859         5.00
       1.789     0.825000        26663         5.71
       1.916     0.850000        27472         6.67
       2.141     0.875000        28277         8.00
       2.319     0.887500        28682         8.89
       2.575     0.900000        29091        10.00
       2.879     0.912500        29490        11.43
       3.341     0.925000        29893        13.33
       3.981     0.937500        30297        16.00
       4.359     0.943750        30500        17.78
       4.819     0.950000        30703        20.00
       5.275     0.956250        30905        22.86
       5.839     0.962500        31105        26.67
       6.575     0.968750        31307        32.00
       7.075     0.971875        31408        35.56
       7.587     0.975000        31509        40.00
       8.111     0.978125        31610        45.71
       8.911     0.981250        31711        53.33
       9.759     0.984375        31812        64.00
      10.287     0.985938        31863        71.11
      10.879     0.987500        31914        80.00
      11.303     0.989062        31964        91.43
      12.079     0.990625        32014       106.67
      12.983     0.992188        32064       128.00
      13.479     0.992969        32089       142.22
      13.911     0.993750        32115       160.00
      14.447     0.994531        32140       182.86
      15.255     0.995313        32166       213.33
      16.255     0.996094        32190       256.00
      16.895     0.996484        32203       284.44
      17.711     0.996875        32216       320.00
      18.335     0.997266        32228       365.71
      18.959     0.997656        32241       426.67
      19.791     0.998047        32253       512.00
      20.223     0.998242        32260       568.89
      20.799     0.998437        32266       640.00
      21.279     0.998633        32272       731.43
      21.823     0.998828        32279       853.33
      22.783     0.999023        32285      1024.00
      23.071     0.999121        32288      1137.78
      23.391     0.999219        32291      1280.00
      23.519     0.999316        32294      1462.86
      24.655     0.999414        32298      1706.67
      25.151     0.999512        32301      2048.00
      25.263     0.999561        32302      2275.56
      25.967     0.999609        32304      2560.00
      26.207     0.999658        32305      2925.71
      27.359     0.999707        32307      3413.33
      28.143     0.999756        32309      4096.00
      28.143     0.999780        32309      4551.11
      28.575     0.999805        32310      5120.00
      29.103     0.999829        32311      5851.43
      29.279     0.999854        32312      6826.67
      30.431     0.999878        32313      8192.00
      30.431     0.999890        32313      9102.22
      30.431     0.999902        32313     10240.00
      30.879     0.999915        32314     11702.86
      30.879     0.999927        32314     13653.33
      30.991     0.999939        32315     16384.00
      30.991     0.999945        32315     18204.44
      30.991     0.999951        32315     20480.00
      30.991     0.999957        32315     23405.71
      30.991     0.999963        32315     27306.67
      31.263     0.999969        32316     32768.00
      31.263     1.000000        32316          inf
#[Mean    =        1.722, StdDeviation   =        2.062]
#[Max     =       31.248, Total count    =        32316]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  87342 requests in 30.00s, 5.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 1188
Requests/sec:   2911.37
Transfer/sec:    190.49KB